In [30]:
# Import the necessary libraries

import pyodbc
from dotenv import dotenv_values
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import plotly.express as px
import warnings
warnings.filterwarnings('ignore')

In [31]:
# Load environment variables from .env file into a dictionary
db_variables = dotenv_values('.env')


# Get the values for the credentials you set in the '.env' file
server = db_variables.get("SERVER")
database = db_variables.get("DATABASE")
username = db_variables.get("USER")
password = db_variables.get("PASSWORD")

connection = f"DRIVER={{ODBC Driver 18 for SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password};MARS_Connection=yes;MinProtocolVersion=TLSv1.2;"

In [32]:
# Connect to the tables in the db

conn = pyodbc.connect(connection)

query = "SELECT * FROM dbo.oil"
query1 = "SELECT * FROM dbo.holidays_events"
query2 = "SELECT * FROM dbo.stores"

In [33]:
# dbo.oil

table1 = pd.read_sql(query,conn)
table1.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02   93.139999
2  2013-01-03   92.970001
3  2013-01-04   93.120003
4  2013-01-07   93.199997

In [34]:
# dbo.holidays_events

table2 = pd.read_sql(query1,conn)
table2.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [35]:
# dbo.stores

table3 = pd.read_sql(query2,conn)
table3.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [55]:
test = pd.concat([table1,table2,table3], ignore_index=True,sort=False, verify_integrity=True,axis=0)
test.head()

,date,dcoilwtico,type,locale,locale_name,description,transferred,store_nbr,city,state,cluster
0,2013-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2013-01-02,93.139999,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2013-01-03,92.970001,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2013-01-04,93.120003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2013-01-07,93.199997,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [57]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1622 entries, 0 to 1621
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1568 non-null   object
 1   dcoilwtico   1175 non-null   float64
 2   type         404 non-null    object
 3   locale       350 non-null    object
 4   locale_name  350 non-null    object
 5   description  350 non-null    object
 6   transferred  350 non-null    object
 7   store_nbr    54 non-null     float64
 8   city         54 non-null     object
 9   state        54 non-null     object
 10  cluster      54 non-null     float64
dtypes: float64(3), object(8)
memory usage: 139.5+ KB

In [58]:
test.isna().sum()

date             54
dcoilwtico      447
type           1218
locale         1272
locale_name    1272
description    1272
transferred    1272
store_nbr      1568
city           1568
state          1568
cluster        1568
dtype: int64

### 2nd dataset

In [37]:
# sample_submission

df_sample = pd.read_csv('sample_submission.csv')
df_sample.head()

        id  sales
0  3000888    0.0
1  3000889    0.0
2  3000890    0.0
3  3000891    0.0
4  3000892    0.0

In [38]:
df_test = pd.read_csv('test.csv')
df_test.head()

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [45]:
df = pd.merge(df_test,df_sample, on='id', how='right')
df.head()

        id        date  store_nbr      family  onpromotion  sales
0  3000888  2017-08-16          1  AUTOMOTIVE            0    0.0
1  3000889  2017-08-16          1   BABY CARE            0    0.0
2  3000890  2017-08-16          1      BEAUTY            2    0.0
3  3000891  2017-08-16          1   BEVERAGES           20    0.0
4  3000892  2017-08-16          1       BOOKS            0    0.0

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           28512 non-null  int64
 1   date         28512 non-null  object
 2   store_nbr    28512 non-null  int64
 3   family       28512 non-null  object
 4   onpromotion  28512 non-null  int64
 5   sales        28512 non-null  float64
dtypes: float64(1), int64(3), object(2)
memory usage: 1.3+ MB

In [53]:
df.isna().sum()

id             0
date           0
store_nbr      0
family         0
onpromotion    0
sales          0
dtype: int64

### 3rd Dataset

In [ ]:
df_trx = pd.read_csv("transactions.csv")
df_trx.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [47]:
df_train = pd.read_csv("E:\\AZUBI CAREER ACCELERATOR\\Data Analytics\\PROJECTS\\Project 3\\LP3 Regression Project\\store-sales-forecasting\\train.csv")
df_train.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [50]:
df1 = pd.concat([df_trx,df_train],ignore_index=True,axis=0 )
df1.head()

         date  store_nbr  transactions  id family  sales  onpromotion
0  2013-01-01         25         770.0 NaN    NaN    NaN          NaN
1  2013-01-02          1        2111.0 NaN    NaN    NaN          NaN
2  2013-01-02          2        2358.0 NaN    NaN    NaN          NaN
3  2013-01-02          3        3487.0 NaN    NaN    NaN          NaN
4  2013-01-02          4        1922.0 NaN    NaN    NaN          NaN

In [54]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3084376 entries, 0 to 3084375
Data columns (total 7 columns):
 #   Column        Dtype
---  ------        -----
 0   date          object
 1   store_nbr     int64
 2   transactions  float64
 3   id            float64
 4   family        object
 5   sales         float64
 6   onpromotion   float64
dtypes: float64(4), int64(1), object(2)
memory usage: 164.7+ MB

In [56]:
df1.isna().sum()

date                  0
store_nbr             0
transactions    3000888
id                83488
family            83488
sales             83488
onpromotion       83488
dtype: int64

### EDA

In [64]:
df.head(2)

        id        date  store_nbr      family  onpromotion  sales
0  3000888  2017-08-16          1  AUTOMOTIVE            0    0.0
1  3000889  2017-08-16          1   BABY CARE            0    0.0

In [65]:
df1.head(2)

         date  store_nbr  transactions  id family  sales  onpromotion
0  2013-01-01         25         770.0 NaN    NaN    NaN          NaN
1  2013-01-02          1        2111.0 NaN    NaN    NaN          NaN

In [66]:
data = pd.concat([df1,df],ignore_index=True)
data.head()

         date  store_nbr  transactions  id family  sales  onpromotion
0  2013-01-01         25         770.0 NaN    NaN    NaN          NaN
1  2013-01-02          1        2111.0 NaN    NaN    NaN          NaN
2  2013-01-02          2        2358.0 NaN    NaN    NaN          NaN
3  2013-01-02          3        3487.0 NaN    NaN    NaN          NaN
4  2013-01-02          4        1922.0 NaN    NaN    NaN          NaN

In [68]:
data.shape

(3112888, 7)

In [69]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3112888 entries, 0 to 3112887
Data columns (total 7 columns):
 #   Column        Dtype
---  ------        -----
 0   date          object
 1   store_nbr     int64
 2   transactions  float64
 3   id            float64
 4   family        object
 5   sales         float64
 6   onpromotion   float64
dtypes: float64(4), int64(1), object(2)
memory usage: 166.2+ MB

In [70]:
data.isna().sum()

date                  0
store_nbr             0
transactions    3029400
id                83488
family            83488
sales             83488
onpromotion       83488
dtype: int64

In [72]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
store_nbr,3112888.0,2.748496e+01,15.586649,1.0,14.00,27.0,41.00,54.0
transactions,83488.0,1.694602e+03,963.286644,5.0,1046.00,1393.0,2079.00,8359.0
id,3029400.0,1.514700e+06,874512.597079,0.0,757349.75,1514699.5,2272049.25,3029399.0
sales,3029400.0,3.544084e+02,1097.343491,0.0,0.00,10.0,192.00,124717.0
onpromotion,3029400.0,2.643830e+00,12.332875,0.0,0.00,0.0,0.00,741.0

In [78]:
categorical = data.select_dtypes(include='object').columns
categorical

Index(['date', 'family'], dtype='object')

In [81]:
numerical = data.select_dtypes(include='number').columns
numerical

Index(['store_nbr', 'transactions', 'id', 'sales', 'onpromotion'], dtype='object')